Public Attributes | List of all members
API_RevolvedShellData Struct Reference
Element Manager API
This structure holds the Revolved Shell specific data of API_ShellType. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | slantAngle
Relative to the plane (radians).
double  | revolutionAngle
Angle of view (in radians).
double  | distortionAngle
Angle of shear (radians).
bool  | segmentedSurfaces
The surface generated by revolving the profile is broken into planes along the revolution arc.
API_ShellBaseSegmentTypeID  | segmentType
Curve resolution method: by circle or by arc.
Int32  | segmentsByArc
Number of actual segments if segmentType is APIShellBase_SegmentsByArc.
Int32  | segmentsByCircle
Number of actual segments if segmentType is APIShellBase_SegmentsByCircle.
API_Polygon  | shellShape
Profile polygon specification to revolve. The shape data arrays are held in the first API_ShellShapeData record of shellShapes in API_ElementMemo.
API_Tranmat  | axisBase
Coord System of axis.
API_Vector  | distortionVector
Direction of shear (in axisBase x-y plane)..
API_ContourEdgeData  | begShapeEdgeData
edge information for the starting plane of the shell
API_ContourEdgeData  | endShapeEdgeData
edge information for the end plane of the shell
API_ContourEdgeData  | revolvedEdgeDatas [2]
edge information for the edges connecting points of the starting and end plane.
double  | begAngle
Begin angle.
Detailed Description
This structure holds the Revolved Shell specific data of API_ShellType.
Remarks
For shell related memo data see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ axisBase
 API_RevolvedShellData::axisBase
Coord System of axis.
◆ begAngle
 API_RevolvedShellData::begAngle
Begin angle.
◆ begShapeEdgeData
 API_RevolvedShellData::begShapeEdgeData
edge information for the starting plane of the shell
◆ distortionAngle
 API_RevolvedShellData::distortionAngle
Angle of shear (radians).
◆ distortionVector
 API_RevolvedShellData::distortionVector
Direction of shear (in axisBase x-y plane)..
◆ endShapeEdgeData
 API_RevolvedShellData::endShapeEdgeData
edge information for the end plane of the shell
◆ revolutionAngle
 API_RevolvedShellData::revolutionAngle
Angle of view (in radians).
◆ revolvedEdgeDatas
 API_RevolvedShellData::revolvedEdgeDatas
edge information for the edges connecting points of the starting and end plane.
◆ segmentedSurfaces
 API_RevolvedShellData::segmentedSurfaces
The surface generated by revolving the profile is broken into planes along the revolution arc.
◆ segmentsByArc
 API_RevolvedShellData::segmentsByArc
Number of actual segments if segmentType is APIShellBase_SegmentsByArc.
◆ segmentsByCircle
 API_RevolvedShellData::segmentsByCircle
Number of actual segments if segmentType is APIShellBase_SegmentsByCircle.
◆ segmentType
 API_RevolvedShellData::segmentType
Curve resolution method: by circle or by arc.
◆ shellShape
 API_RevolvedShellData::shellShape
Profile polygon specification to revolve. The shape data arrays are held in the first API_ShellShapeData record of shellShapes in API_ElementMemo.
◆ slantAngle
 API_RevolvedShellData::slantAngle
Relative to the plane (radians).